/*
 *  Copyright (C) 2021 Texas Instruments Incorporated
 *
 *  Redistribution and use in source and binary forms, with or without
 *  modification, are permitted provided that the following conditions
 *  are met:
 *
 *    Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 *    Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the
 *    distribution.
 *
 *    Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 *  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 *  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 *  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
 *  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 *  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 *  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
 *  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
 *  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT

#define    ADDR_ERR_EN_CLR_START                                             (1U)
#define    ADDR_ERR_EN_CLR_END                                               (1U)

/* Definition for field PROT_ERR_EN_CLR in Register INTR_ENABLE_CLEAR */
#define    PROT_ERR_EN_CLR_START                                             (0U)
#define    PROT_ERR_EN_CLR_END                                               (0U)

/* Definition for field EOI_VECTOR in Register EOI */
#define    EOI_VECTOR_START                                                  (0U)
#define    EOI_VECTOR_END                                                    (7U)

/* Definition for field FAULT_ADDR in Register FAULT_ADDRESS */
#define    FAULT_ADDR_START                                                  (0U)
#define    FAULT_ADDR_END                                                    (31U)

/* Definition for field FAULT_NS in Register FAULT_TYPE_STATUS */
#define    FAULT_NS_START                                                    (6U)
#define    FAULT_NS_END                                                      (6U)

/* Definition for field FAULT_TYPE in Register FAULT_TYPE_STATUS */
#define    FAULT_TYPE_START                                                  (0U)
#define    FAULT_TYPE_END                                                    (5U)

/* Definition for field FAULT_XID in Register FAULT_ATTR_STATUS */
#define    FAULT_XID_START                                                   (20U)
#define    FAULT_XID_END                                                     (31U)

/* Definition for field FAULT_ROUTEID in Register FAULT_ATTR_STATUS */
#define    FAULT_ROUTEID_START                                               (8U)
#define    FAULT_ROUTEID_END                                                 (19U)

/* Definition for field FAULT_PRIVID in Register FAULT_ATTR_STATUS */
#define    FAULT_PRIVID_START                                                (0U)
#define    FAULT_PRIVID_END                                                  (7U)

/* Definition for field FAULT_CLR in Register FAULT_CLEAR */
#define    FAULT_CLR_START                                                   (0U)
#define    FAULT_CLR_END                                                     (0U)


/* Definition for CDF_CNT_BINNUM_SAMPLE in RAM HWA_HIST_THRESH_RAM  */
#define    CDF_CNT_BINNUM_SAMPLE_START                                       (24U)
#define    CDF_CNT_BINNUM_SAMPLE_END                                          (29U)

/* Definition for CDF_CNT_CDFVAL_SAMPLE in RAM HWA_HIST_THRESH_RAM  */
#define    CDF_CNT_CDFVAL_SAMPLE_START                                       (12U)
#define    CDF_CNT_CDFVAL_SAMPLE_END                                          (23U)

/* Definition for CDF_CNT_HISTVAL_SAMPLE in RAM HWA_HIST_THRESH_RAM  */
#define    CDF_CNT_HISTVAL_SAMPLE_START                                       (0U)
#define    CDF_CNT_HISTVAL_SAMPLE_END                                          (11U)

/** @struct hwaAccVal
*   @brief  HWA accumulator register data structure
*
*/
typedef volatile struct hwaAccVal_t
{
    uint32_t    accValLSB;        /* AddrOffset = 0x000 */
    uint32_t    accValMSB;        /* AddrOffset = 0x004 */
} hwaAccVal;


/**
 * @struct DSSHWACCRegs_t
 * @brief
 *   Module DSS_HW_ACC Register Definition
 * @details
 *   This structure is used to access the DSS_HW_ACC module registers.
 */
typedef volatile struct DSSHWACCRegs_t
{

    uint32_t      PID                                         ;      /* offset = 0x0000 */
    uint32_t      PARAM_RAM_IDX                               ;      /* offset = 0x0004 */
    uint32_t      PARAM_RAM_LOOP                              ;      /* offset = 0x0008 */
    uint32_t      PARAM_RAM_IDX_ALT                           ;      /* offset = 0x000C */
    uint32_t      PARAM_RAM_LOOP_ALT                          ;      /* offset = 0x0010 */
    uint32_t      HWA_ENABLE                                  ;      /* offset = 0x0014 */
    uint32_t      CS_CONFIG                                   ;      /* offset = 0x0018 */
    uint32_t      FW2DMA_TRIG                                 ;      /* offset = 0x001C */
    uint32_t      DMA2HWA_TRIG                                ;      /* offset = 0x0020 */
    uint32_t      SIGDMACHDONE[32]                            ;      /* offset = 0x0024 - 0x00A0 */
    uint32_t      FW2HWA_TRIG_0                               ;      /* offset = 0x00A4 */
    uint32_t      FW2HWA_TRIG_1                               ;      /* offset = 0x00A8 */
    uint32_t      CS_FW2ACC_TRIG                              ;      /* offset = 0x00AC */
    uint32_t      BPM_PATTERN[8]                              ;      /* offset = 0x00B0 - 0x00CC */
    uint32_t      BPM_RATE                                    ;      /* offset = 0x00D0 */
    uint32_t      PARAM_DONE_SET_STATUS[2]                    ;      /* offset = 0x00D4 - 0x00D8 */
    uint32_t      PARAM_DONE_CLR[2]                           ;      /* offset = 0x00DC - 0x00E0 */
    uint32_t      TRIGGER_SET_STATUS[2]                       ;      /* offset = 0x00E4 - 0x00E8 */
    uint32_t      TRIGGER_SET_IN_CLR[2]                       ;      /* offset = 0x00EC - 0x00F0 */
    uint32_t      DC_EST_RESET_SW                             ;      /* offset = 0x00F4 */
    uint32_t      DC_EST_CTRL                                 ;      /* offset = 0x00F8 */
    uint32_t      DC_EST_I_VAL[12]                            ;      /* offset = 0x00FC - 0x0128 */
    uint32_t      DC_EST_Q_VAL[12]                            ;      /* offset = 0x012C - 0x0158 */
    hwaAccVal     DC_ACC_I_VAL[12]                ;      /* offset = 0x015C - 0x01B8 */
    hwaAccVal     DC_ACC_Q_VAL[12]                ;      /* offset = 0x01BC - 0x0218 */
    uint32_t      DC_ACC_CLIP_STATUS                          ;      /* offset = 0x021C */
    uint32_t      DC_EST_CLIP_STATUS                          ;      /* offset = 0x0220 */
    uint32_t      DC_I_SW[12]                                 ;      /* offset = 0x0224 - 0x0250 */
    uint32_t      DC_Q_SW[12]                                 ;      /* offset = 0x0254 - 0x0280 */
    uint32_t      DC_SUB_CLIP                                 ;      /* offset = 0x0284 */
    uint32_t      DC_RESERVED_2                               ;      /* offset = 0x0288 */
    uint32_t      DC_RESERVED_3                               ;      /* offset = 0x028C */
    uint32_t      DC_RESERVED_4                               ;      /* offset = 0x0290 */
    uint32_t      DC_RESERVED_5                               ;      /* offset = 0x0294 */
    uint32_t      INTF_STATS_RESET_SW                         ;      /* offset = 0x0298 */
    uint32_t      INTF_STATS_CTRL                             ;      /* offset = 0x029C */
    uint32_t      INTF_LOC_THRESH_MAG_VAL[12]                 ;      /* offset = 0x02A0 - 0x02CC */
    uint32_t      INTF_LOC_THRESH_MAGDIFF_VAL[12]             ;      /* offset = 0x02D0 - 0x02FC */
    uint32_t      INTF_LOC_COUNT_ALL_CHIRP                    ;      /* offset = 0x0300 */
    uint32_t      INTF_LOC_COUNT_ALL_FRAME                    ;      /* offset = 0x0304 */
    hwaAccVal     INTF_STATS_MAG_ACC[12]          ;      /* offset = 0x0308 - 0x0364 */
    hwaAccVal     INTF_STATS_MAGDIFF_ACC[12]        ;      /* offset = 0x0368 - 0x03C4 */
    uint32_t      INTF_LOC_THRESH_MAG_SW[12]                  ;      /* offset = 0x03C8 - 0x03F4 */
    uint32_t      INTF_LOC_THRESH_MAGDIFF_SW[12]              ;      /* offset = 0x03F8 - 0x0424 */
    uint32_t      INTF_STATS_ACC_CLIP_STATUS                  ;      /* offset = 0x0428 */
    uint32_t      INTF_STATS_THRESH_CLIP_STATUS               ;      /* offset = 0x042C */
    uint32_t      INTF_MITG_WINDOW_PARAM[5]                   ;      /* offset = 0x0430 - 0x0440 */
    uint32_t      INTF_STATS_SUM_MAG_VAL                      ;      /* offset = 0x0444 */
    uint32_t      INTF_STATS_SUM_MAG_VAL_CLIP_STATUS          ;      /* offset = 0x0448 */
    uint32_t      INTF_STATS_SUM_MAGDIFF_VAL                  ;      /* offset = 0x044C */
    uint32_t      INTF_STATS_SUM_MAGDIFF_VAL_CLIP_STATUS        ;      /* offset = 0x0450 */
    uint32_t      INTERF_RESERVED_5                           ;      /* offset = 0x0454 */
    uint32_t      ICMULT_SCALE[12]                            ;      /* offset = 0x0458 - 0x0484 */
    uint32_t      QCMULT_SCALE[12]                            ;      /* offset = 0x0488 - 0x04B4 */
    uint32_t      TWID_INCR_DELTA_FRAC                        ;      /* offset = 0x04B8 */
    uint32_t      RECWIN_RESET_SW                             ;      /* offset = 0x04BC */
    uint32_t      TWID_INCR_DELTA_FRAC_RESET_SW               ;      /* offset = 0x04C0 */
    uint32_t      TWID_INCR_DELTA_FRAC_CLIP_STATUS            ;      /* offset = 0x04C4 */
    uint32_t      RECWIN_INIT_KVAL                            ;      /* offset = 0x04C8 */
    uint32_t      CMULT_RESERVED_2                            ;      /* offset = 0x04CC */
    uint32_t      CHAN_COMB_SIZE                              ;      /* offset = 0x04D0 */
    uint32_t      CHAN_COMB_VEC[8]                            ;      /* offset = 0x04D4 - 0x04F0 */
    uint32_t      CHANNEL_COMB_CLIP_STATUS                    ;      /* offset = 0x04F4 */
    uint32_t      ZERO_INSERT_NUM                             ;      /* offset = 0x04F8 */
    uint32_t      ZERO_INSERT_MASK[8]                         ;      /* offset = 0x04FC - 0x0518 */
    uint32_t      ZERO_INSERT_RESERVED_1                      ;      /* offset = 0x051C */
    uint32_t      ZERO_INSERT_RESERVED_2                      ;      /* offset = 0x0520 */
    uint32_t      ZERO_INSERT_RESERVED_3                      ;      /* offset = 0x0524 */
    uint32_t      ZERO_INSERT_RESERVED_4                      ;      /* offset = 0x0528 */
    uint32_t      LFSR_SEED                                   ;      /* offset = 0x052C */
    uint32_t      LFSR_LOAD                                   ;      /* offset = 0x0530 */
    uint32_t      DITHER_TWID_EN                              ;      /* offset = 0x0534 */
    uint32_t      FFT_CLIP                                    ;      /* offset = 0x0538 */
    uint32_t      CLR_FFTCLIP                                 ;      /* offset = 0x053C */
    uint32_t      CLR_CLIP_MISC                               ;      /* offset = 0x0540 */
    uint32_t      IP_OP_FORMATTER_CLIP_STATUS                 ;      /* offset = 0x0544 */
    uint32_t      FFT_RESERVED_1                              ;      /* offset = 0x0548 */
    uint32_t      FFT_RESERVED_2                              ;      /* offset = 0x054C */
    uint32_t      FFT_RESERVED_3                              ;      /* offset = 0x0550 */
    uint32_t      MAX_VALUE[4]                                ;      /* offset = 0x0554 - 0x0560*/
    uint32_t      MAX_INDEX[4]                                ;      /* offset = 0x0564 - 0x0570*/
    hwaAccVal     I_SUM_VALUE[4]                              ;      /* offset = 0x0574 - 0x0590*/
    hwaAccVal     Q_SUM_VALUE[4]                              ;      /* offset = 0x0594 - 0x05B0*/
    uint32_t      FFTSUMDIV                                   ;      /* offset = 0x05B4 */
    uint32_t      MAX2D_OFFSET_DIM1                           ;      /* offset = 0x05B8 */
    uint32_t      MAX2D_OFFSET_DIM2                           ;      /* offset = 0x05BC */
    uint32_t      CDF_CNT_THRESH                              ;      /* offset = 0x05C0 */
    uint32_t      STATS_RESERVED_1                            ;      /* offset = 0x05C4 */
    uint32_t      STATS_RESERVED_2                            ;      /* offset = 0x05C8 */
    uint32_t      STATS_RESERVED_3                            ;      /* offset = 0x05CC */
    uint32_t      STATS_RESERVED_4                            ;      /* offset = 0x05D0 */
    uint32_t      STATS_RESERVED_5                            ;      /* offset = 0x05D4 */
    uint32_t      CFAR_PEAKCNT                                ;      /* offset = 0x05D8 */
    uint32_t      CFAR_DET_THR                                ;      /* offset = 0x05DC */
    uint32_t      CFAR_TEST_REG                               ;      /* offset = 0x05E0 */
    uint32_t      CFAR_THRESH                                 ;      /* offset = 0x05E4 */
    uint32_t      CFAR_RESERVED_1                             ;      /* offset = 0x05E8 */
    uint32_t      CFAR_RESERVED_2                             ;      /* offset = 0x05EC */
    uint32_t      CFAR_RESERVED_3                             ;      /* offset = 0x05F0 */
    uint32_t      CFAR_RESERVED_4                             ;      /* offset = 0x05F4 */
    uint32_t      CMP_EGE_K0123                               ;      /* offset = 0x05F8 */
    uint32_t      CMP_EGE_K4567                               ;      /* offset = 0x05FC */
    uint32_t      MEM_INIT_START                              ;      /* offset = 0x0600 */
    uint32_t      MEM_INIT_DONE                               ;      /* offset = 0x0604 */
    uint32_t      MEM_INIT_STATUS                             ;      /* offset = 0x0608 */
    uint32_t      LM_THRESH_VAL                               ;      /* offset = 0x060C */
    uint32_t      LM_2DSTATS_BASE_ADDR                        ;      /* offset = 0x0610 */
    uint32_t      HWA_SAFETY_EN                               ;      /* offset = 0x0614 */
    uint32_t      HWA_SAFETY_ERR_MASK                         ;      /* offset = 0x0618 */
    uint32_t      HWA_SAFETY_ERR_STATUS                       ;      /* offset = 0x061C */
    uint32_t      HWA_SAFETY_ERR_STATUS_RAW                   ;      /* offset = 0x0620 */
    uint32_t      HWA_SAFETY_DMEM_ERR_ADDR[8]                 ;      /* offset = 0x0624 - 0x0640 */
    uint32_t      HWA_SAFETY_WINDOW_RAM_ERR_ADDR              ;      /* offset = 0x0644 */
    uint32_t      MEM_ACCESS_ERR_STATUS                       ;      /* offset = 0x0648 */
    uint32_t      LOOP_CNT                                    ;      /* offset = 0x064C */
    uint32_t      PARAMADDR                                   ;      /* offset = 0x0650 */
    uint32_t      PARAMADDR_CPUINTR[2]                        ;      /* offset = 0x0654 - 0x0658 */
    uint32_t      FSM_STATE                                   ;      /* offset = 0x065C */
    uint32_t      SINGLE_STEP_EN                              ;      /* offset = 0x0660 */
    uint32_t      SINGLE_STEP_TRIG                            ;      /* offset = 0x0664 */
    uint32_t      HWA_DMEM_A_BUS_SAFETY_CTRL                  ;      /* offset = 0x0668 */
    uint32_t      HWA_DMEM_A_BUS_SAFETY_FI                    ;      /* offset = 0x066C */
    uint32_t      HWA_DMEM_A_BUS_SAFETY_ERR                   ;      /* offset = 0x0670 */
    uint32_t      HWA_CFG_RESERVED_WORD1                      ;      /* offset = 0x0674 */
    uint32_t      HWA_DMEM_A_BUS_SAFETY_ERR_STAT_DATA0        ;      /* offset = 0x0678 */
    uint32_t      HWA_DMEM_B_BUS_SAFETY_CTRL                  ;      /* offset = 0x067C */
    uint32_t      HWA_DMEM_B_BUS_SAFETY_FI                    ;      /* offset = 0x0680 */
    uint32_t      HWA_DMEM_B_BUS_SAFETY_ERR                   ;      /* offset = 0x0684 */
    uint32_t      HWA_CFG_RESERVED_WORD2                      ;      /* offset = 0x0688 */
    uint32_t      HWA_DMEM_B_BUS_SAFETY_ERR_STAT_DATA0        ;      /* offset = 0x068C */
#if defined (SOC_AWR294X)
    /* Below set of registers are valid for only AWR294x ES2.0 samples and are reserved for ES1.0 devices. */
    uint32_t      SW_RESTART_LOOP                             ;      /* offset = 0x0690 */
    uint32_t      REG_CMP_LFSRSEED_0                          ;      /* offset = 0x0694 */
    uint32_t      REG_CMP_LFSRSEED_1                          ;      /* offset = 0x0698 */
    uint32_t      REG_CMP_LFSRLOAD_0                          ;      /* offset = 0x069C */
    uint32_t      REG_CMP_LFSRLOAD_1                          ;      /* offset = 0x06A0 */
    uint32_t      HWA_CFG_RESERVED[601]                       ;      /* offset = 0x06A4 - 0x1004 */
#endif
#if defined (SOC_AM273X)
    uint32_t      HWA_CFG_RESERVED[606]                       ;      /* offset = 0x0690 - 0x1004 */
#endif
    uint32_t      LOCK0_KICK0                                 ;      /* offset = 0x1008 */
    uint32_t      LOCK0_KICK1                                 ;      /* offset = 0x100C */
    uint32_t      INTR_RAW_STATUS                             ;      /* offset = 0x1010 */
    uint32_t      INTR_ENABLED_STATUS_CLEAR                   ;      /* offset = 0x1014 */
    uint32_t      INTR_ENABLE                                 ;      /* offset = 0x1018 */
    uint32_t      INTR_ENABLE_CLEAR                           ;      /* offset = 0x101C */
    uint32_t      EOI                                         ;      /* offset = 0x1020 */
    uint32_t      FAULT_ADDRESS                               ;      /* offset = 0x1024 */
    uint32_t      FAULT_TYPE_STATUS                           ;      /* offset = 0x1028 */
    uint32_t      FAULT_ATTR_STATUS                           ;      /* offset = 0x102C */
    uint32_t      FAULT_CLEAR                                 ;      /* offset = 0x1030 */
} DSSHWACCRegs;

#ifdef __cplusplus
}
#endif

#endif /* HW_HWA_COMMONREG_H_ */

